Courses/7370/Lectures/Projects/WB-C-RPC/0README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-22 Wed 08:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A White Board Project using ONR RPC</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">A White Board Project using ONR RPC</h1>
<p>
Please read <a href="../7370projects.html">DIC Projects</a> first.  This <code>0README</code> is a supplement to the
lectures.  It describes a bit of the philosophy behind the course and
some details of the source code given to you as a start.
</p>

<div id="outline-container-orgbed6ccb" class="outline-2">
<h2 id="orgbed6ccb"><span class="section-number-2">1</span> Prerequisites</h2>
<div class="outline-text-2" id="text-1">
<p>
This course expects that you are already comfortable in the use of
networked machines based on Linux/Unix and X11.  Learn to login to
remote machines via ssh without having to interactively type your
password each time; read
<a href="http://cecs.wright.edu/~pmateti/Courses/2350/Labs/Network/NetworkLab.html#ssh">2350/ NetworkLab #ssh</a>
</p>

<p>
Students whose Linux OS programming skills are rusty should study
examples for {<code>alarm, fork, pipes, signals, bash</code> scripting} much
simpler than what you see in our project files.  At WSU, we expect CEG
4350/6350 OS Internals and Design to have taught these.  Recommended
book: W. Richard Stevens and Stephen A. Rago, Advanced Programming in
the Unix Environment, Addison-Wesley, ISBN:
0-201-56317-7. <a href="http://www.apuebook.com/">http://www.apuebook.com/</a>
</p>

<p>
Some of you worry this is C and not C++.  C is a subset of C++.  Also,
the code does use lower-than-what-is-typical-in-C++ libraries.  One of
the goals of this course: Expose you to the basics of systems
programming relevant to distributed computing.  If you know C++ well
enough, you should be able to fully understand C.  Some quick equiv C
v C++: <code>malloc/free</code> v <code>new/delete</code> mem allocation; <code>static</code> v
<code>private</code> scope; <code>static</code> v <code>static</code> life time; <code>e1? e2 : e3</code> v <code>e1?
e2 : e3</code> conditional expression;
</p>

<p>
RPC background is not expected.  Several of the RPC lib procedures
will be discussed in class.  On Linux, these have become part of C std
lib; on other OS you may have to explicitly give <code>-lrpcsvc</code> to the
linker (<code>ld</code> of <code>gcc</code> or <code>g++</code>).
</p>
</div>
</div>

<div id="outline-container-org6f5a7d0" class="outline-2">
<h2 id="org6f5a7d0"><span class="section-number-2">2</span> How Does It Work?</h2>
<div class="outline-text-2" id="text-2">
<p>
We will go over this in the lectures.
</p>
</div>
</div>

<div id="outline-container-orga4c0342" class="outline-2">
<h2 id="orga4c0342"><span class="section-number-2">3</span> Compilation + Make</h2>
<div class="outline-text-2" id="text-3">
<p>
Expand the tar ball of source code
<code>7370-WB-C-RPC-2014.tbz</code> using <code>tar xvvfj 7370-WB-C-RPC-2014.tbz</code>
</p>

<p>
It is expected that you will study the source code closely.  It is
only 800+ lines.  You should become so familiar with it <b>as if</b> you
wrote it.  The only exception is xwindow.c; just read the comments.
</p>

<p>
The source code as given is ready to be built using <code>make</code>.  There
should be no compilation/link warnings except possibly in
<code>rpcgen</code>-erated code.  It should also run without any glitches.  If
these are not working out (i) in the OSIS Lab, report problems to me,
(ii) on Linux systems elsewhere, I may be able to help, but there is
too much ground to cover.  Below <code>%</code> is my bash prompt as a non-root
user.
</p>
</div>

<div id="outline-container-orgf786f1f" class="outline-3">
<h3 id="orgf786f1f"><span class="section-number-3">3.1</span> Original v Generated Files</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The following are the "original" (i.e., created by a human programmer)
files.
</p>

<div class="org-src-container">
<pre class="src src-bash">Makefile  the makefile for the project
server.x  server rpc interface
server.c  server specific code
client.x  client rpc interface
client.c  client specific code
ed-script to generate client_s.c from client_svc.c
xwindow.c a collection of simple X11 procedures
transient.c gets a vacant program number
</pre>
</div>
</div>
</div>

<div id="outline-container-org69f0f20" class="outline-3">
<h3 id="org69f0f20"><span class="section-number-3">3.2</span> Details</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li><code>rpcgen server.x</code> generates <code>server.h server_xdr.c server_clnt.c server_svc.c</code></li>

<li><code>rpcgen client.x</code> generates <code>client.h client_xdr.c client_clnt.c client_svc.c</code></li>

<li><code>client_s.c</code> is a minor variation of <code>client_svc.c</code> mechanically
produced by running an editor script on <code>client_svc.c</code>.  We insert
<code>startclient(...)</code>   just above the <code>svcrun()</code> line.</li>

<li>Just the <code>xwindow.c</code> can be compiled as a stand-alone program
<code>xwindow7370</code> to check for X11 problems.</li>

<li>Note the use of <code>static int i</code> within procedures; such an <code>i</code> is
not allocated on the stack.  This makes <code>i</code> "stay/live" even after
that procedure returns.</li>

<li>Keep the compiler flags <code>-Wall -ansi -pedantic -std=c99</code> on;
read-up on what these do.  There should be zero errors/ warnings.
The <code>rpcgen</code> generated code unfortunately is not as kosher.  Note
also that non-Linux OS may have ancient rpcgens that generate even
worse code so far as these flags are concerned.</li>

<li>Our code uses <code>alarm</code>, <code>fork</code>, <code>pipe</code> s, and <code>signal</code> s. Our (simple
minded) use of signals requires <code>-D_BSD_SIGNALS.</code></li>

<li>The <code>% make</code> will compile the source code file <code>deregall.c</code> into a
program named <code>deregall7370</code>.  This can de-register transient RPC
processes.</li>

<li>To clean up the project dir, invoke <code>% make clean</code>.</li>
<li>To archive a version, do <code>% make tar</code></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org158c854" class="outline-2">
<h2 id="org158c854"><span class="section-number-2">4</span> How to Run It</h2>
<div class="outline-text-2" id="text-4">
<p>
Some of you may wish to use your own Linux boxes for 7370 work.  But
Linux installations out-of-the-box are typically not "open" enough for
us.  Check your Linux Setup first.
</p>

<ol class="org-ol">
<li>Host names below can be IP addresses (better/ simpler actually).
In the OSIS lab, we use private IP addresses <code>192.168.17.*</code></li>

<li>In the source code as given: The server is one process running on
host H1.  The client consists of two processes both running on host
H2.  It is ok, but not desirable that H1 == H2.  H2 is where the
X11 server is also running, using the bash-equaivalent of <code>export
   DISPLAY=H2:0.0</code></li>

<li>Run the "server" as a background process on a machine of your choice.<br />
<code>% server7370 &amp;</code></li>

<li>Run the "client" from one or more machines of your choice.  The
 client needs four arguments:<br />
<code>% client7370 &lt;srv-mchn-nm&gt; &lt;wb-nm&gt; &lt;wb-disp&gt; &lt;color&gt;</code><br />
<code>&lt;srv-mchn-nm&gt;</code> is the name of the machine running your server;
 <code>&lt;wb-nm&gt;</code> is the name of the whiteboard you wish to create/join;
 <code>&lt;wb-disp&gt;</code> is the name of the machine you are logged in for the
 X11 display; <code>&lt;color&gt;</code> is a 6-hex-digit X11 RGB color number for
 lines of this client;</li>
</ol>

<p>
Here are a few bash procedures:
A simple "smoke test" with all the processes running on <code>localhost</code> and 
kill all and deregister 7370 related processes.
Read <code>man killall</code> and <code>man pkill</code>.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #0000ff;">smokeTest7370</span>() {
  ./server7370 &amp;
  <span style="color: #483d8b;">echo</span> -n Server started, press Return to continue; <span style="color: #483d8b;">read</span>
  ./client7370 localhost b0 localhost ff0000 &amp; <span style="color: #b22222;"># </span><span style="color: #b22222;">RGB=ff0000 = red</span>
  <span style="color: #483d8b;">echo</span> -n client started, press Return to continue; <span style="color: #483d8b;">read</span>
  ./client7370 localhost b0 localhost ff00 &amp; <span style="color: #b22222;"># </span><span style="color: #b22222;">RGB=00ff00 = green</span>
  <span style="color: #483d8b;">echo</span> -n client started; press Return to continue; <span style="color: #483d8b;">read</span>
  ./client7370 localhost b0 localhost ff &amp; <span style="color: #b22222;"># </span><span style="color: #b22222;">RGB=0000ff = blue</span>
  <span style="color: #483d8b;">echo</span> -n client started, press Return to continue; <span style="color: #483d8b;">read</span>
  rpcinfo -p
}

<span style="color: #0000ff;">killall7370</span>() {
  killall -q server7370 client7370
  ./deregall7370 536871065  <span style="color: #b22222;"># </span><span style="color: #b22222;">change this to your server num</span>
  ./deregall7370
  rpcinfo -p
}

<span style="color: #0000ff;">freshStart7370</span>() {
  killall7370
  smokeTest7370
  ps
  rpcinfo -p
}
</pre>
</div>

<p>
Locate where <code>rpcinfo</code> is.  Perhaps it is in <code>/usr/sbin</code> instead of
<code>/usr/bin</code>.  Read its man page.  Here is an example invocation on
Linux machines:
</p>

<div class="org-src-container">
<pre class="src src-bash">% rpcinfo -p
   program vers proto   port
    100000    2   tcp    111  portmapper
    100000    2   udp    111  portmapper
    ... more lines
</pre>
</div>

<p>
Do the above after a fresh reboot.  This shows the presence of other
standard RPC processes.  After you "close" your WB project demo, the
list then should be the same.
</p>
</div>
</div>

<div id="outline-container-org286bdcc" class="outline-2">
<h2 id="org286bdcc"><span class="section-number-2">5</span> Miscellaneous</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Learn to use <code>backtrace()</code>; it will offset the time you may otherwise
waste in debugging. <a href="http://www.gnu.org/software/libc/manual/html_node/Backtraces.html">http://www.gnu.org/software/libc/manual/html_node/Backtraces.html</a></li>

<li>See what libraries are actually in use: <code>% ldd client7370 server7370</code></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2020 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2020-01-21
</div>
</body>
</html>
